Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི། བྱང་ཆུབ་ཀྱི་ལམ་མོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། ནང་སྟོང་པ་ཉིད་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་མོ།
en: Venerable Śāradvatīputra, the emptiness of internal phenomena constitutes the bodhisattva great beings’ path to enlightenment.

source: །ཕྱི་སྟོང་པ་ཉིད་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་མོ།
en: The emptiness of external phenomena constitutes the path to enlightenment that bodhisattva great beings pursue.

source: །ཕྱི་ནང་སྟོང་པ་ཉིད་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི། བྱང་ཆུབ་ཀྱི་ལམ་མོ།
en: The emptiness of external and internal phenomena constitutes the bodhisattva great beings’ path to enlightenment. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་མོ།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, constitute the bodhisattva great beings’ path to enlightenment. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་མོ། །ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: Venerable Śāradvatīputra, the four applications of mindfulness constitute the bodhisattva great beings’ path to enlightenment.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་མོ།
en: The four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path constitute the bodhisattva great beings’ path to enlightenment. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། འཕགས་པའི་བདེན་པ་བཞི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་མོ། །བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: Venerable Śāradvatīputra, the four truths of the noble ones constitute the bodhisattva great beings’ path to enlightenment.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་མོ།
en: The four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the five extrasensory powers, all the meditative stabilities, and all the dhāraṇī gateways constitute the bodhisattva great beings’ path to enlightenment.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་མོ། །མི་འཇིགས་པ་བཞི་དང་།
en: The ten powers of the tathāgatas constitute the bodhisattva great beings’ path to enlightenment.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་མོ།
en: The four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas constitute the bodhisattva great beings’ path to enlightenment.” “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལེགས་སོ་ལེགས་སོ།
en: Well said!

source: །བྱང་ཆུབ་ཀྱི་ལམ་འདི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་གི་མཐུ་ཡིན། རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མཐུ་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Which of the perfections is the efficacious power of this path to enlightenment?” “

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི། འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། ཉན་ཐོས་ཀྱི་ཆོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་དང་།
en: Venerable Śāradvatīputra,” replied Subhūti, “it is the perfection of wisdom that generates the attributes of the śrāvakas, the attributes of the pratyekabuddhas, the attributes of the bodhisattvas, the attributes of the buddhas, and all virtuous attributes.

source: དགེ་བའི་ཆོས་ཐམས་ཅད་སྐྱེད་པའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། ཉན་ཐོས་ཀྱི་ཆོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་སྡུད་ཅིང་ཡང་དག་པར་སྡུད་པའོ།
en: Venerable Śāradvatīputra, the perfection of wisdom subsumes and is the subsumer of the attributes of the śrāvakas, the attributes of the pratyekabuddhas, the attributes of the bodhisattvas, the attributes of the buddhas, and all virtuous attributes.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་སྤྱད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ།
en: Venerable Śāradvatīputra, the tathāgatas, arhats, completely awakened buddhas of the past indeed attained manifest buddhahood in unsurpassed, complete enlightenment, having practiced this perfection of wisdom.

source: མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་སྤྱོད་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ།
en: Venerable Śāradvatīputra, the tathāgatas, arhats, completely awakened buddhas of the future will indeed attain manifest buddhahood in unsurpassed, complete enlightenment, having practiced this perfection of wisdom.

source: ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་། འཚོ་སྐྱོང་བ་དེ་དག་གིས་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་སྤྱད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ།
en: Venerable Śāradvatīputra, all the tathāgatas, arhats, completely awakened buddhas who are alive at the present time, residing in the world systems of the ten directions, indeed attain manifest buddhahood in unsurpassed, complete enlightenment, having practiced this perfection of wisdom. “

source: གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བཤད་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནེམ་ནུར་འམ། རྨོངས་པར་མི་འགྱུར་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་འདི་ལྟར། སེམས་ཅན་ཐམས་ཅད་བསྐྱབ་པ་དང་།
en: Venerable Śāradvatīputra, when the perfection of wisdom is explained, if bodhisattva great beings are without consternation or without stupidity, then, Venerable Śāradvatīputra, one should know that these bodhisattva great beings do engage in this way of life without apprehending anything, because they offer sanctuary to all beings and do not forsake any beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བའི་ཕྱིར། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་རྣམ་པར་སྤྱོད་པ་འདི་རྣམ་པར་སྤྱོད་པར་ཤེས་པར་བྱའོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་འདི་ལྟར། སྙིང་རྗེ་ཆེན་པོ་ཡིད་ལ་བྱ་བའི་ཡིད་ལ་བྱ་བ་དེ་དང་མ་བྲལ་བར་ཤེས་པར་བྱའོ།
en: One should know that these bodhisattva great beings are not separated from the attentiveness of great compassion.” “

source: །སྨྲས་པ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་རྣམ་པར་སྤྱོད་པ་འདིས་རྣམ་པར་སྤྱོད་ཅིང་འདི་ལྟ་སྟེ། སྙིང་རྗེ་ཆེན་པོ་ཡིད་ལ་བྱ་བའི་ཡིད་ལ་བྱ་བ་དེ་དང་མ་བྲལ་བས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོར་འདོད་ན། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ལྟ་ན་ནི། སེམས་ཅན་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔར་འགྱུར་རོ།
en: Venerable Subhūti, if you hold that those who engage in this way of life are bodhisattva great beings because they focus their attention with great compassion and never part from focusing their attention, then in that case, Venerable Subhūti, in that case all beings would indeed be bodhisattvas. {

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་སེམས་ཅན་ཐམས་ཅད་ཀྱང་ཡིད་ལ་བྱ་བ་དང་ནི་མ་བྲལ་ལོ།
en: Dt.268} If you ask why would that be, Venerable Subhūti, it is because all beings never part from focusing their attention.” “

source: །རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལེགས་སོ་ལེགས་སོ།
en: Venerable Śāradvatīputra, well said! Well said!” replied Subhūti. “

source: །དྲིའོ་དྲིའོ་སྙམ་པའི་དོན་དེ་ཉིད། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཡང་དག་པའི་ཚིག་བརྗོད་པས་ཡོངས་སུ་བཟུང་ངོ་།
en: Venerable Śāradvatīputra, you have grasped the very point of the question and what you say is quite true.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ།
en: If you ask why this is so, Venerable Śāradvatīputra, it is like this.

source: སེམས་ཅན་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is nonexistent because beings are nonexistent.

source: །སེམས་ཅན་དངོས་པོ་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དངོས་པོ་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is a nonentity because beings are nonentities.

source: །སེམས་ཅན་རང་བཞིན་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་རང་བཞིན་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is without inherent existence because beings are without inherent existence.

source: །སེམས་ཅན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: One should know that attention is emptiness because beings are emptiness.

source: །སེམས་ཅན་དབེན་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་དབེན་པར་རིག་པར་བྱའོ།
en: One should know that attention is void because beings are void.

source: །སེམས་ཅན་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་རིག་པར་བྱའོ།
en: One should know that attention will not attain consummate buddhahood because beings will not attain consummate buddhahood. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། གཟུགས་མེད་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ།
en: Venerable Śāradvatīputra, one should know that attention is nonexistent because physical forms are nonexistent.

source: །གཟུགས་དངོས་པོ་མེད་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་དངོས་པོ་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is a nonentity because physical forms are nonentities.

source: །གཟུགས་རང་བཞིན་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་རང་བཞིན་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is without inherent existence because physical forms are without inherent existence.

source: །གཟུགས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: One should know that attention is emptiness because physical forms are emptiness.

source: །གཟུགས་དབེན་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་དབེན་པར་རིག་པར་བྱའོ།
en: One should know that attention is void because physical forms are void.

source: །གཟུགས་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་རིག་པར་བྱའོ།
en: One should know that attention will not attain consummate buddhahood because physical forms will not attain consummate buddhahood. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མེད་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ།
en: Venerable Śāradvatīputra, one should know that attention is nonexistent because feelings, perceptions, formative predispositions, and consciousness are nonexistent.

source: །རྣམ་པར་ཤེས་པ་དངོས་པོ་མེད་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་དངོས་པོ་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is a nonentity because consciousness [and so forth] are nonentities.

source: །རྣམ་པར་ཤེས་པ་རང་བཞིན་མེད་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་རང་བཞིན་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is without inherent existence because consciousness [and so forth] are without inherent existence.

source: །རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: One should know that attention is emptiness because consciousness [and so forth] are emptiness.

source: །རྣམ་པར་ཤེས་པ་དབེན་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་དབེན་པར་རིག་པར་བྱའོ།
en: One should know that attention is void because consciousness [and so forth] are void.

source: །རྣམ་པར་ཤེས་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་རིག་པར་བྱའོ།
en: One should know that attention will not attain consummate buddhahood because consciousness [and so forth] will not attain consummate buddhahood. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མེད་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ།
en: Venerable Śāradvatīputra, one should know that attention is nonexistent because the sense fields, the sensory elements, and the links of dependent origination are nonexistent.

source: །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དངོས་པོ་མེད་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་དངོས་པོ་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is a nonentity because the links of dependent origination [and so forth] are nonentities.

source: །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་རང་བཞིན་མེད་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་རང་བཞིན་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is without inherent existence because the links of dependent origination [and so forth] are without inherent existence.

source: །རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: One should know that attention is emptiness because the links of dependent origination [and so forth] are emptiness.

source: །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དབེན་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་དབེན་པར་རིག་པར་བྱའོ།
en: One should know that attention is void because the links of dependent origination [and so forth] are void.

source: །རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་རིག་པར་བྱའོ།
en: One should know that attention will not attain consummate buddhahood because the links of dependent origination [and so forth] will not attain consummate buddhahood. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མེད་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ།
en: Venerable Śāradvatīputra, one should know that attention is nonexistent because the perfection of generosity is nonexistent.

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དངོས་པོ་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དངོས་པོ་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is a nonentity because the perfection of generosity is a nonentity.

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རང་བཞིན་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་རང་བཞིན་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is without inherent existence because the perfection of generosity is without inherent existence.

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: One should know that attention is emptiness because the perfection of generosity is emptiness.

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དབེན་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་དབེན་པར་རིག་པར་བྱའོ།
en: One should know that attention is void because the perfection of generosity is void.

source: །སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་རིག་པར་བྱའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ།
en: One should know that attention will not attain consummate buddhahood because the perfection of generosity will not attain consummate buddhahood. “

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མེད་པའི་ཕྱིར།
en: Venerable Śāradvatīputra, one should know that attention is nonexistent because the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are nonexistent.

source: ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དངོས་པོ་མེད་པའི་ཕྱིར།
en: One should know that attention is a nonentity because the perfection of wisdom [and so forth] are nonentities.

source: ཡིད་ལ་བྱེད་པ་དངོས་པོ་མེད་པར་རིག་པར་བྱའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རང་བཞིན་མེད་པའི་ཕྱིར།
en: One should know that attention is without inherent existence because the perfection of wisdom [and so forth] are without inherent existence.

source: ཡིད་ལ་བྱེད་པ་རང་བཞིན་མེད་པར་རིག་པར་བྱའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: One should know that attention is emptiness because the perfection of wisdom [and so forth] are emptiness.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དབེན་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དབེན་པར་རིག་པར་བྱའོ།
en: One should know that attention is void because the perfection of wisdom [and so forth] are void.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་རིག་པར་བྱའོ།
en: One should know that attention will not attain consummate buddhahood because the perfection of wisdom [and so forth] will not attain consummate buddhahood. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། ནང་སྟོང་པ་ཉིད་ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ།
en: Venerable Śāradvatīputra, one should know that attention is nonexistent because the emptiness of internal phenomena is nonexistent.

source: །ནང་སྟོང་པ་ཉིད་དངོས་པོ་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དངོས་པོ་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is a nonentity because the emptiness of internal phenomena is a nonentity.

source: །ནང་སྟོང་པ་ཉིད་རང་བཞིན་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་རང་བཞིན་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is without inherent existence because the emptiness of internal phenomena is without inherent existence.

source: །ནང་སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: One should know that attention is emptiness because the emptiness of internal phenomena is emptiness.

source: །ནང་སྟོང་པ་ཉིད་དབེན་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དབེན་པར་རིག་པར་བྱའོ།
en: One should know that attention is void because the emptiness of internal phenomena is void.

source: །ནང་སྟོང་པ་ཉིད་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་རིག་པར་བྱའོ།
en: One should know that attention will not attain consummate buddhahood because the emptiness of internal phenomena will not attain consummate buddhahood. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ།
en: Venerable Śāradvatīputra, one should know that attention is nonexistent because [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are nonexistent.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དངོས་པོ་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དངོས་པོ་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is a nonentity because [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are nonentities.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རང་བཞིན་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་རང་བཞིན་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is without inherent existence because [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are without inherent existence.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: One should know that attention is emptiness because [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are emptiness.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དབེན་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དབེན་པར་རིག་པར་བྱའོ།
en: One should know that attention is void because [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are void.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་རིག་པར་བྱའོ།
en: One should know that attention will not attain consummate buddhahood because [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, will not attain consummate buddhahood. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། དྲན་པ་ཉེ་བར་གཞག་པ་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ།
en: Venerable Śāradvatīputra, one should know that attention is nonexistent because the applications of mindfulness are nonexistent.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་དངོས་པོ་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དངོས་པོ་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is a nonentity because the applications of mindfulness are nonentities.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རང་བཞིན་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་རང་བཞིན་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is without inherent existence because the applications of mindfulness are without inherent existence.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: One should know that attention is emptiness because the applications of mindfulness are emptiness.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་དབེན་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དབེན་པར་རིག་པར་བྱའོ།
en: One should know that attention is void because the applications of mindfulness are void.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་རིག་པར་བྱའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། ཡང་དག་པར་སྤོང་བ་དང་།
en: One should know that attention will not attain consummate buddhahood because the applications of mindfulness will not attain consummate buddhahood. “

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མེད་པའི་ཕྱིར།
en: Venerable Śāradvatīputra, one should know that attention is nonexistent because the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are nonexistent.

source: ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ། །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དངོས་པོ་མེད་པའི་ཕྱིར།
en: One should know that attention is a nonentity because the noble eightfold path [and so forth] are nonentities.

source: ཡིད་ལ་བྱེད་པ་དངོས་པོ་མེད་པར་རིག་པར་བྱའོ། །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་རང་བཞིན་མེད་པའི་ཕྱིར།
en: One should know that attention is without inherent existence because the noble eightfold path [and so forth] are without inherent existence.

source: ཡིད་ལ་བྱེད་པ་རང་བཞིན་མེད་པར་རིག་པར་བྱའོ། །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: One should know that attention is emptiness because the noble eightfold path [and so forth] are emptiness.

source: །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དབེན་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དབེན་པར་རིག་པར་བྱའོ།
en: One should know that attention is void because the noble eightfold path [and so forth] are void.

source: །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་རིག་པར་བྱའོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: One should know that attention will not attain consummate buddhahood because the noble eightfold path [and so forth] will not attain consummate buddhahood. “

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: One should know that attention is nonexistent because the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas are nonexistent.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དངོས་པོ་མེད་པའི་ཕྱིར།
en: One should know that attention is a nonentity because the distinct qualities of the buddhas [and so forth] are nonentities.

source: ཡིད་ལ་བྱེད་པ་དངོས་པོ་མེད་པར་རིག་པར་བྱའོ། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རང་བཞིན་མེད་པའི་ཕྱིར།
en: One should know that attention is without inherent existence because the distinct qualities of the buddhas [and so forth] are without inherent existence.
